##  Análise da dade com SQL e PANDAS

#Series

In [2]:
import pandas as pd
import numpy as np
from numpy.random import *

In [3]:
labels = ['a', 'b', 'c']

minha_lista = [10, 20,30]

arr = np.array([10, 20, 30])

d = {'a': 10, 'b': 20, 'c': 30}

In [4]:
pd.Series(labels) # os numeros da direita sao os indices, cada linha da lista

0    a
1    b
2    c
dtype: object

In [5]:
pd.Series(data= labels, index= minha_lista) # agora definimos quem é o indice e quem é a lista

10    a
20    b
30    c
dtype: object

In [6]:
pd.Series(d) # no caso de dicionário ele automaticamente ja define o da esquerda como indice

a    10
b    20
c    30
dtype: int64

In [7]:
ser1 = pd.Series([1, 2, 3, 4], index= ['EUA', 'Alemanha', 'Rússia', 'Japão' ])

In [8]:
ser1

EUA         1
Alemanha    2
Rússia      3
Japão       4
dtype: int64

In [9]:
ser2 = pd.Series([1, 2, 5, 4], index= ['EUA', 'Alemanha', 'Itália', 'Japão' ])

In [10]:
ser2

EUA         1
Alemanha    2
Itália      5
Japão       4
dtype: int64

In [11]:
ser1[['Alemanha','Rússia']]

Alemanha    2
Rússia      3
dtype: int64

In [12]:
ser1 + ser2 #ele faz uma casamento, procura quem tem indice igual e soma a/s colunas seguintes. NaN nao tem numero

Alemanha    4.0
EUA         2.0
Itália      NaN
Japão       8.0
Rússia      NaN
dtype: float64

## Data Frames

In [13]:
df = pd.DataFrame(randn(5, 4), index='a b c d e '.split(), columns= 'w x y z'.split())

In [14]:
df

          w         x         y         z
a -0.183029 -2.685632 -1.203240  0.849946
b -0.135255  0.003078 -0.548810  0.033050
c -0.342971  0.797081 -0.826586 -0.234330
d  0.508287  1.111179 -1.736303  0.112120
e -0.696876  0.053166 -1.472651 -0.382450

In [15]:
type(df)

pandas.core.frame.DataFrame

#manipulando as colunas

In [16]:
df[['w', 'y']] #chamando apenas a coluna

          w         y
a -0.183029 -1.203240
b -0.135255 -0.548810
c -0.342971 -0.826586
d  0.508287 -1.736303
e -0.696876 -1.472651

In [17]:
df['new'] = df['w'] # cria uma coluna com os valores da coluna 'w'

In [18]:
df

          w         x         y         z       new
a -0.183029 -2.685632 -1.203240  0.849946 -0.183029
b -0.135255  0.003078 -0.548810  0.033050 -0.135255
c -0.342971  0.797081 -0.826586 -0.234330 -0.342971
d  0.508287  1.111179 -1.736303  0.112120  0.508287
e -0.696876  0.053166 -1.472651 -0.382450 -0.696876

In [19]:
df['new'] = df['w'] + df['y'] # soma os valores da coluna 'w' com 'y'

In [20]:
df

          w         x         y         z       new
a -0.183029 -2.685632 -1.203240  0.849946 -1.386269
b -0.135255  0.003078 -0.548810  0.033050 -0.684065
c -0.342971  0.797081 -0.826586 -0.234330 -1.169557
d  0.508287  1.111179 -1.736303  0.112120 -1.228016
e -0.696876  0.053166 -1.472651 -0.382450 -2.169527

In [21]:
# del df['new'] ou df.drop('new' , axis = 1) #remove a coluna axis 1 é coluna axis 0 é linha

In [22]:
df.drop('new' , axis = 1) # deleta a coluna. basta por um inplace=true para que altere o arquivo original

          w         x         y         z
a -0.183029 -2.685632 -1.203240  0.849946
b -0.135255  0.003078 -0.548810  0.033050
c -0.342971  0.797081 -0.826586 -0.234330
d  0.508287  1.111179 -1.736303  0.112120
e -0.696876  0.053166 -1.472651 -0.382450

In [23]:
df # como nao atribuiu a funcao acima a df ele apenas demonstra como dica a tabela mas sem altera-la.  basta por um inplace=true para que altere o arquivo original

          w         x         y         z       new
a -0.183029 -2.685632 -1.203240  0.849946 -1.386269
b -0.135255  0.003078 -0.548810  0.033050 -0.684065
c -0.342971  0.797081 -0.826586 -0.234330 -1.169557
d  0.508287  1.111179 -1.736303  0.112120 -1.228016
e -0.696876  0.053166 -1.472651 -0.382450 -2.169527

#manipulando as linhas

In [24]:
df.loc['a'] #chama a linha pedida e entrega ela transposta

w     -0.183029
x     -2.685632
y     -1.203240
z      0.849946
new   -1.386269
Name: a, dtype: float64

In [25]:
df.loc[['a', 'b']]

          w         x        y         z       new
a -0.183029 -2.685632 -1.20324  0.849946 -1.386269
b -0.135255  0.003078 -0.54881  0.033050 -0.684065

In [26]:
df.iloc[0,2] #chama a célula especifica

-1.203239975824761

In [27]:
df.loc[['a','b'], 'w'] # linhas de index a e b da coluna w

a   -0.183029
b   -0.135255
Name: w, dtype: float64

In [28]:
df.loc[['a','b'], ['w']] # linhas de index a e b da coluna w, como data frame

          w
a -0.183029
b -0.135255

In [29]:
df

          w         x         y         z       new
a -0.183029 -2.685632 -1.203240  0.849946 -1.386269
b -0.135255  0.003078 -0.548810  0.033050 -0.684065
c -0.342971  0.797081 -0.826586 -0.234330 -1.169557
d  0.508287  1.111179 -1.736303  0.112120 -1.228016
e -0.696876  0.053166 -1.472651 -0.382450 -2.169527

In [30]:
df.iloc[:-1, 1:4] # semelhante as listas [linhas , colunas]

          x         y         z
a -2.685632 -1.203240  0.849946
b  0.003078 -0.548810  0.033050
c  0.797081 -0.826586 -0.234330
d  1.111179 -1.736303  0.112120

In [31]:
df > 0

       w      x      y      z    new
a  False  False  False   True  False
b  False   True  False   True  False
c  False   True  False  False  False
d   True   True  False   True  False
e  False   True  False  False  False

In [32]:
df[df['y'] > 0]

Empty DataFrame
Columns: [w, x, y, z, new]
Index: []

In [33]:
df[(df['y'] >0) & (df['z']> 0)] # & = and

Empty DataFrame
Columns: [w, x, y, z, new]
Index: []

#mais detalhes dos indices

In [34]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [35]:
df.columns

Index(['w', 'x', 'y', 'z', 'new'], dtype='object')

In [36]:
df.reset_index()

  index         w         x         y         z       new
0     a -0.183029 -2.685632 -1.203240  0.849946 -1.386269
1     b -0.135255  0.003078 -0.548810  0.033050 -0.684065
2     c -0.342971  0.797081 -0.826586 -0.234330 -1.169557
3     d  0.508287  1.111179 -1.736303  0.112120 -1.228016
4     e -0.696876  0.053166 -1.472651 -0.382450 -2.169527

In [37]:
df #so aplica se aplicar o inplace=true

          w         x         y         z       new
a -0.183029 -2.685632 -1.203240  0.849946 -1.386269
b -0.135255  0.003078 -0.548810  0.033050 -0.684065
c -0.342971  0.797081 -0.826586 -0.234330 -1.169557
d  0.508287  1.111179 -1.736303  0.112120 -1.228016
e -0.696876  0.053166 -1.472651 -0.382450 -2.169527

In [38]:
df.reset_index(inplace=True)

In [39]:
df#index vira uma coluna

  index         w         x         y         z       new
0     a -0.183029 -2.685632 -1.203240  0.849946 -1.386269
1     b -0.135255  0.003078 -0.548810  0.033050 -0.684065
2     c -0.342971  0.797081 -0.826586 -0.234330 -1.169557
3     d  0.508287  1.111179 -1.736303  0.112120 -1.228016
4     e -0.696876  0.053166 -1.472651 -0.382450 -2.169527

In [40]:
df.set_index('index', inplace=True)

In [41]:
df

              w         x         y         z       new
index
a     -0.183029 -2.685632 -1.203240  0.849946 -1.386269
b     -0.135255  0.003078 -0.548810  0.033050 -0.684065
c     -0.342971  0.797081 -0.826586 -0.234330 -1.169557
d      0.508287  1.111179 -1.736303  0.112120 -1.228016
e     -0.696876  0.053166 -1.472651 -0.382450 -2.169527

In [42]:
novoind = 'ca ny wy or co'.split()

In [43]:
df['novo index'] = novoind

In [44]:
df

              w         x         y         z       new novo index
index
a     -0.183029 -2.685632 -1.203240  0.849946 -1.386269         ca
b     -0.135255  0.003078 -0.548810  0.033050 -0.684065         ny
c     -0.342971  0.797081 -0.826586 -0.234330 -1.169557         wy
d      0.508287  1.111179 -1.736303  0.112120 -1.228016         or
e     -0.696876  0.053166 -1.472651 -0.382450 -2.169527         co

In [45]:
df.reset_index().set_index('novo index')

           index         w         x         y         z       new
novo index
ca             a -0.183029 -2.685632 -1.203240  0.849946 -1.386269
ny             b -0.135255  0.003078 -0.548810  0.033050 -0.684065
wy             c -0.342971  0.797081 -0.826586 -0.234330 -1.169557
or             d  0.508287  1.111179 -1.736303  0.112120 -1.228016
co             e -0.696876  0.053166 -1.472651 -0.382450 -2.169527

In [46]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object', name='index')

## hierarquia de indices e indices multiplos

In [47]:
# níveis de indices 
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]

hier_index = list(zip(outside,inside)) #zip , encaixa as duas listas e forma uma tupla

In [48]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [49]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [50]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [51]:
df = pd.DataFrame(np.random.randn(6,2), index=hier_index, columns= ['a', 'b'])
df

             a         b
G1 1 -0.206070  0.748426
   2 -0.100033  2.086285
   3 -0.883188  0.426363
G2 1  0.281764 -0.551934
   2 -0.327594  0.112289
   3  1.548807 -0.524917

In [52]:
df.loc['G1']

          a         b
1 -0.206070  0.748426
2 -0.100033  2.086285
3 -0.883188  0.426363

In [53]:
df.loc['G1'].loc[[1]]

         a         b
1 -0.20607  0.748426

In [54]:
df.index.names = ['grupo', 'numero']
df

                     a         b
grupo numero
G1    1      -0.206070  0.748426
      2      -0.100033  2.086285
      3      -0.883188  0.426363
G2    1       0.281764 -0.551934
      2      -0.327594  0.112289
      3       1.548807 -0.524917

In [55]:
df.xs(1, level='numero')

              a         b
grupo
G1    -0.206070  0.748426
G2     0.281764 -0.551934

#dados ausentes

In [56]:
df = pd.DataFrame({'a': [1,2,np.nan],
                  'b': [5,np.nan,np.nan],
                  'c': [1,2,3],})
df

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [57]:
df.dropna()

     a    b  c
0  1.0  5.0  1

In [58]:
df.dropna(axis=0)

     a    b  c
0  1.0  5.0  1

In [59]:
df.dropna(axis=1)

   c
0  1
1  2
2  3

In [60]:
df.dropna(axis=1,thresh=2) #elimina o limite de 2 nan

     a  c
0  1.0  1
1  2.0  2
2  NaN  3

In [61]:
df.fillna(0)

     a    b  c
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [62]:
df['a'].mean()

1.5

In [63]:
df['a'].fillna(value=df['a'].mean())# preencheu os valores nan com a media da coluna a

0    1.0
1    2.0
2    1.5
Name: a, dtype: float64

In [64]:
df

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [65]:
df.ffill()#preenche o nan com os valores de cima

     a    b  c
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

In [66]:
#dfill preenche com os dados abaixo

## groupby

In [67]:
#group.sum(numeric_only=True)

In [68]:
data = {
        'Classe': ['Júnior','Júnior', 'Pleno', 'Pleno', 'Sênior', 'Sênior'],
        'Nome': ['Jorge','Carlos', 'Roberta', 'Patrícia', 'Bruno', 'Vera'],
        'Venda': [200,120, 340, 124, 243, 350],

}

In [69]:
df = pd.DataFrame(data)
df

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350

In [70]:
group = df.groupby('Classe')

In [71]:
group.sum(numeric_only=True)

        Venda
Classe
Júnior    320
Pleno     464
Sênior    593

In [72]:
df2 = df.copy()

In [73]:
df2

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350

In [74]:
df2['Venda'] = [150,432,190,230,410,155]

In [75]:
df2

   Classe      Nome  Venda
0  Júnior     Jorge    150
1  Júnior    Carlos    432
2   Pleno   Roberta    190
3   Pleno  Patrícia    230
4  Sênior     Bruno    410
5  Sênior      Vera    155

In [76]:
df3 = pd.concat([df,df2])
df3

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350
0  Júnior     Jorge    150
1  Júnior    Carlos    432
2   Pleno   Roberta    190
3   Pleno  Patrícia    230
4  Sênior     Bruno    410
5  Sênior      Vera    155

In [77]:
df3.groupby(['Classe', 'Nome']).sum(numeric_only=True)

                 Venda
Classe Nome
Júnior Carlos      552
       Jorge       350
Pleno  Patrícia    354
       Roberta     530
Sênior Bruno       653
       Vera        505

## merge, join e concat ver na apostila

In [78]:
# ver na abostila de aulas

## Dados temporais

In [79]:
numero_de_dias = 100

In [80]:
datas = pd.date_range(start = '1/2/2021', periods= numero_de_dias )

In [81]:
datas

DatetimeIndex(['2021-01-02', '2021-01-03', '2021-01-04', '2021-01-05',
               '2021-01-06', '2021-01-07', '2021-01-08', '2021-01-09',
               '2021-01-10', '2021-01-11', '2021-01-12', '2021-01-13',
               '2021-01-14', '2021-01-15', '2021-01-16', '2021-01-17',
               '2021-01-18', '2021-01-19', '2021-01-20', '2021-01-21',
               '2021-01-22', '2021-01-23', '2021-01-24', '2021-01-25',
               '2021-01-26', '2021-01-27', '2021-01-28', '2021-01-29',
               '2021-01-30', '2021-01-31', '2021-02-01', '2021-02-02',
               '2021-02-03', '2021-02-04', '2021-02-05', '2021-02-06',
               '2021-02-07', '2021-02-08', '2021-02-09', '2021-02-10',
               '2021-02-11', '2021-02-12', '2021-02-13', '2021-02-14',
               '2021-02-15', '2021-02-16', '2021-02-17', '2021-02-18',
               '2021-02-19', '2021-02-20', '2021-02-21', '2021-02-22',
               '2021-02-23', '2021-02-24', '2021-02-25', '2021-02-26',
               '2021-02-27', '2021-02-28', '2021-03-01', '2021-03-02',
               '2021-03-03', '2021-03-04', '2021-03-05', '2021-03-06',
               '2021-03-07', '2021-03-08', '2021-03-09', '2021-03-10',
               '2021-03-11', '2021-03-12', '2021-03-13', '2021-03-14',
               '2021-03-15', '2021-03-16', '2021-03-17', '2021-03-18',
               '2021-03-19', '2021-03-20', '2021-03-21', '2021-03-22',
               '2021-03-23', '2021-03-24', '2021-03-25', '2021-03-26',
               '2021-03-27', '2021-03-28', '2021-03-29', '2021-03-30',
               '2021-03-31', '2021-04-01', '2021-04-02', '2021-04-03',
               '2021-04-04', '2021-04-05', '2021-04-06', '2021-04-07',
               '2021-04-08', '2021-04-09', '2021-04-10', '2021-04-11'],
              dtype='datetime64[ns]', freq='D')

In [82]:
df = pd.DataFrame(range(numero_de_dias), columns=['Numeros'], index= datas)

In [83]:
df

            Numeros
2021-01-02        0
2021-01-03        1
2021-01-04        2
2021-01-05        3
2021-01-06        4
...             ...
2021-04-07       95
2021-04-08       96
2021-04-09       97
2021-04-10       98
2021-04-11       99

[100 rows x 1 columns]

## entrada e saida de dados

In [84]:
df1 = pd.read_csv('filename', sep=',', decimal="." ) #tem que estar no mesmo diretório caso nao basta descrever o diretório e por o nome do arquivo
#sep é como os dados estao se parados e decimal é como esta definido o decimal na tabela

FileNotFoundError: [Errno 2] No such file or directory: 'filename'

In [ ]:
df1.to_csv('filename2.csv', sep=',', decimal='.' ) #nome no qual o arquivo sera salvo